# NewCombinableElementArray Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewCombinableElementArray Method
Application Class See Also
---
Returns an array that can hold combinable element objects.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CombinableElementArray NewCombinableElementArray()
```

Visual Basic
---
```text
Public Function NewCombinableElementArray As CombinableElementArray
```

Visual C++
---
```text
public:
CombinableElementArray^ NewCombinableElementArray()
```

# ### Return Value
An empty array that can contain any CombinableElement derived objects.
# See Also
Application Class
Autodesk.Revit.Creation Namespace